app/use_cases/pokemons/create_use_case.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = NULL LIMIT 1
---
    def service_execute
      @user=User.find(@user)