app/services/pokemons/create.rb

  	def service_execute
       pokemon = Pokemon.new(
       	name: @pokemon.name,
        nickname: @nickname,
        hp: @pokemon.stats(num: 0),
        atack: @pokemon.stats(num: 1),
        special_atack: @pokemon.stats(num: 2),
        defense: @pokemon.stats(num: 3),
        special_defense: @pokemon.stats(num: 4),
        speed: @pokemon.stats(num: 5),
        description: @description.description,
        atack0: @pokemon.attacks(num: 0),
        atack1: @pokemon.attacks(num: 2),
        atack2: @pokemon.attacks(num: 4),
        atack3: @pokemon.attacks(num: 6),
        user: @user,
        type_of_pokemon: @pokemon.type_of_pokemon,
        habitat: @description.habitat,
        capture_rate: @description.capture_rate,
        base_happiness: @description.base_happiness,
        num_pokedex: @pokemon.num_pokedex,
        image: @pokemon.image
       )
       pokemon.save!
---
INSERT INTO `pokemons` (`name`, `nickname`, `num_pokedex`, `hp`, `atack`, `special_atack`, `defense`, `special_defense`, `speed`, `description`, `atack0`, `atack1`, `atack2`, `atack3`, `user_id`, `type_of_pokemon`, `habitat`, `capture_rate`, `base_happiness`, `url_image`) VALUES ('Bulbasaur', 'sadasd', 1, 45, 49, 49, 65, 65, 45, 'A strange seed was\nplanted on its\nback at birth.The plant sprouts\nand grows with\nthis POKéMON.', 'Razor-wind', 'Cut', 'Vine-whip', 'Tackle', 1, 'Grass', 'Grassland', 0, 70, 'https://raw.githubusercontent.com/PokeAPI/sprites/master/sprites/pokemon/versions/generation-vi/omegaruby-alphasapphire/1.png')