app/services/pokemons/update.rb

UPDATE `pokemons` SET `nickname` = 'Charm' WHERE `pokemons`.`id` = 9
---
    def service_execute
    	@pokemon.update(
    		nickname: @nickname
    	)